ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_usbfs_dev_drv.h
/***************************************************************************//**
* \file cy_usbfs_dev_drv.h
* \version 2.0
*
* Provides API declarations of the USBFS driver.
*
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


/**
* \addtogroup group_usbfs_dev_drv
* \{
* The USBFS driver provides an API to interact with a fixed-function USB block.
*
* The functions and other declarations used in this driver are in cy_usbfs_dev_drv.h. 
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions 
* and declarations in the PDL. 
* 
* The USB block supports Host and Device modes of operation. This version of the
* driver supports only Device mode.
*
* <b>Features:</b>
* * Complies with USB Specification 2.0
* * Supports full-speed peripheral device operation with a signaling bit 
*   rate of 12 Mbps.
* * Supports eight data endpoints and one control endpoint.
* * Provides a shared 512-byte buffer for data endpoints.
* * Provides dedicated 8-byte memory for control endpoint (EP0).
* * Supports four types of transfers: bulk, interrupt, isochronous, and control
* * Supports bus- and self-powered configurations
* * Supports USB suspend, resume, and remove wakeup.
* * Supports three types of logical transfer modes: 
*   * CPU (No DMA) mode (Mode 1).
*   * Manual DMA mode (Mode 2).
*   * Automatic DMA mode (Mode 3).
* * Supports the maximum packet size: 
*   * 512 bytes using Mode 1 and Mode 2.
*   * 1023 bytes for isochronous transfer using Mode 3.
* * Provides integrated 22 Ohm USB termination resistors on D+ and D- lines, 
*   and 1.5 kOhm pull-up resistor on the D+ line.
* * Supports USB 2.0 Link Power Management (LPM).
*
*
********************************************************************************
* \section group_usbfs_dev_drv_use_cases Common Use Cases
********************************************************************************
*
* <b>The primary usage model for the USBFS driver is to provide a defined API 
* interface to <a href="../../usbfs_dev_api_reference_manual.html" target="_blank">USB Device Middleware</a> 
* component that works on top of it.</b> \n
* The driver also provides an API interface for the application to implement the required 
* functionality: 
*  * \ref group_usbfs_dev_drv_callbacks
*  * \ref group_usbfs_dev_drv_low_power
*  * \ref group_usbfs_dev_drv_lpm
*  * \ref group_usbfs_dev_drv_vbus
*
********************************************************************************
* \section group_usbfs_dev_drv_configuration Configuration Considerations
********************************************************************************
* 
* This section explains how to configure the USBFS driver and system resources to 
* enable USB Device operation. The pointers to the populated \ref cy_stc_usbfs_dev_drv_config_t configuration 
* structure and allocated context are passed in the middleware initialization.
* function Cy_USB_Dev_Init. After middleware initialization, it calls 
* \ref Cy_USBFS_Dev_Drv_Init to initialize the USBFS driver for Device operation.

********************************************************************************
* \subsection group_usbfs_dev_drv_config Configure Driver
********************************************************************************
* 
* To configure the USBFS driver in Device mode, the configuration structure 
* \ref cy_stc_usbfs_dev_drv_config_t parameters must be populated. 
* The configuration structure content significantly depends on the selected 
* endpoints management mode parameter:
*
* * \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU \n
*   The <i>epAccess, intrLevelSel and enableLpm</i> must be provided. All 
*   other parameters are do not cares for this mode. Refer to section 
*   \ref group_usbfs_dev_drv_intr to get information about <i>intrLevelSel</i> 
*   configuration.
*
*   \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_CfgCpu
*
* * \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA \n
*   To enable DMA operation, the DMA channels must be assigned for each endpoint 
*   to be used. Each DMA channel needs a single DMA descriptor to 
*   operate. The USBFS driver defines the DMA configuration structure 
*   \ref cy_stc_usbfs_dev_drv_dma_config_t to be populated for each DMA 
*   channel.
*   The code example below provides an initialized USBFS driver DMA configuration 
*   structure:
*   
*   \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_CfgDma_DmaInit
*
*   The pointers to the DMA configuration structure are required into the 
*   \ref cy_stc_usbfs_dev_drv_config_t USBFS driver configuration structure
*   to allow the USBFS driver to use DMA channels for used endpoints. 
*   The <i>dmaConfig[0]</i> field expects a pointer to the DMA configuration for 
*   data endpoint 1, the <i>dmaConfig[1]</i> field pointer to the DMA configuration 
*   for data endpoint 2, and so on up to data endpoint 8.
*   The code example below provides an initialized USBFS driver configuration 
*   structure which uses endpoint 1:
*
*   \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_CfgDma
*   
* * \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO \n
*   DMA Automatic mode needs a DMA channels configuration similar to the described 
*   above. But it also requires one more DMA descriptor for each DMA channel and 
*   DMA output trigger multiplexer. Refer to the \ref group_usbfs_dev_drv_dma section,
*   for more detail about the trigger multiplexer .
*   The code example below provides an initialized USBFS driver DMA configuration 
*   structure:
*   
*   \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_CfgDmaAuto_DmaInit
*
*   The driver requires a buffer for data endpoints to operate. This buffer must be
*   allocated by the user. The buffer size is equal to the sum of all used 
*   endpoints maximum packet sizes. If an endpoint belongs to more than 
*   one alternate setting, select the greatest maximum packet size for this 
*   endpoint. The driver configuration structure \ref cy_stc_usbfs_dev_drv_config_t 
*   parameters <i>epBuffer and epBufferSize</i> pass the buffer to the driver.
*
*   The code example below provides an initialized USBFS driver configuration 
*   structure that uses data endpoint 1 with a maximum packet size of 63 bytes and 
*   set 16-bit access:
*    
*   \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_CfgDmaAuto
*
*
* \note
* The endpoint buffer allocation depends on the access type used: 8-bit or 16-bit. 
* Refer to \ref group_usbfs_dev_drv_ep_management_buf_access for more information.
*
********************************************************************************
* \subsection group_usbfs_dev_drv_pins Assign and Configure Pins
********************************************************************************
*
* Only dedicated USB pins can be used for USB operation. Keep the default 
* USB pins configuration because after the USBFS driver initializes, the 
* USB block takes control over the pins and drives them properly.
*
********************************************************************************
* \subsection group_usbfs_dev_drv_clock Assign and Configure Clocks
********************************************************************************
*
* The USB hardware block requires two clock sources for operation:
* * Clk_HF3 (USB clock) must be 48 MHz. The accuracy of the USB clock must be 
*   within -/+ 0.25%. Note that Clk_HF3 has an integer divider so the input 
*   clock can be a multiple of 48. The valid options to get an internal USB 
*   clock are PLL or ECO.\n
*   <b>The typical configuration is:</b> the IMO output is used by the PLL to 
*   generate Clk_HF3 (USB clock). To meet USB clock accuracy requirements 
*   the IMO must be trimmed with USB SOF signal. Therefore, the driver 
*   \ref Cy_USBFS_Dev_Drv_Init function enables the IMO trim from USB.
*
* * Divided Clk_Peri clock (PCLK_USB_CLOCK_DEV_BRS) equal to 100 kHz 
*   used to detect a Bus Reset event. Use one of the 8-bit or 16-bit dividers 
*   to provide required clock frequency.
*
* The code example below shows the connection source path 1 
* (which expected provide 48 MHz -/+ 0.25% clock) to Clk_HF3 and Bus Reset clock 
* (Clk_Peri assumed to be 50 MHz):
*    
* \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_ClockInit
*
* Refer to \ref group_sysclk driver API for more detail about clock 
* configuration.
*
********************************************************************************
* \subsection group_usbfs_dev_drv_dma Assign and Route DMA Channels
********************************************************************************
*
* The USBFS driver requires a DMA controller to operate in DMA Manual and Automatic modes. 
* The USB hardware block supports the DMA request and feedback lines for each 
* data endpoint. Therefore, up to eight DMA channels serve eight data endpoints. 
* The connection between the USB block and the DMA channels is set using the trigger 
* muxes infrastructure. The USB block output DMA request line is connected to 
* the DMA channel trigger input. This allows the USB block to request a DMA transfer. 
* The DMA completion output is connected to the USB block burst end input. 
* This allows the USB block to get notification that a DMA transfer has been completed 
* and a next DMA request can be sent. The USBFS driver DMA configuration 
* structure requires the <i>outTrigMux</i> field to provide the trigger mux that 
* performs DMA completion and USB block burst end connection.
*
* Refer to \ref group_trigmux for more detail on the routing capabilities.
* 
* The code examples below shows a connection DMA channel and USB block and the define 
* for <i>outTrigMux</i> field initialization for the CY8C6xx6 or CY8C6xx7 devices.
*
* \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_DmaConnect
*
********************************************************************************
* \subsection group_usbfs_dev_drv_intr Configure Interrupts
********************************************************************************
*
* <b>The interrupts are mandatory for the USBFS driver operation.</b>
* The USBFS block provides multiple interrupt sources to be assigned to 
* trigger one of the three interrupts: Low, Medium, or High. This allows to 
* assign different priority to the interrupt sources handling.
* The \ref cy_stc_usbfs_dev_drv_config_t structure provides the  
* <i>intrLevelSel</i> field which initializes the INTR_LVL_SEL 
* register. This register configures which interrupt the interrupt source will trigger.
* 
* \note
* The interrupt name (Low, Medium, or High) does not specify the interrupt 
* priority. The interrupt priority is configured in NVIC.
*
* The recommended/default configuration is: 
* * Interrupt Low: Bus Reset, Control Endpoint and SOF.
* * Interrupt Medium: Endpoint 1-8 Completion. 
* * Interrupt High: Arbiter and LPM. 
*
* However, the final configuration must be defined by the application.
*
* \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_UserLvlSel
*
* The \ref Cy_USBFS_Dev_Drv_Interrupt function must be called in the interrupt 
* handler for the selected USB block instance. Note that 
* the \ref Cy_USBFS_Dev_Drv_Interrupt has the parameter <i>intrCause</i> that 
* must be assigned by calling the appropriate interrupt cause function: 
* * \ref Cy_USBFS_Dev_Drv_GetInterruptCauseHi 
* * \ref Cy_USBFS_Dev_Drv_GetInterruptCauseMed 
* * \ref Cy_USBFS_Dev_Drv_GetInterruptCauseLo
*
* \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_IntrHandlers
*
* Finally, the interrupts must be configured and interrupt handler routines 
* hook up to NVIC. The code below assigns the interrupt priorities accordingly 
* to interrupt names. The priorities among the USBFS interrupts are as follows:
* High - the greatest; Medium - the middle; Low - the lowest.
*
* \note
* For proper operation in Manual DMA mode (Mode 2) the Arbiter interrupt source 
* must be assigned to interrupt which priority is greater than interrupt 
* triggered by Data Endpoint 1-8 Completion interrupt sources. \n
* For Automatic DMA mode (Mode 3) the rule above is recommend to follow.
*
* \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_IntrCfg
* \snippet usbfs/snippet/main.c snipped_Cy_USBFS_Dev_Drv_IntrCfgHook
* 
********************************************************************************
* \section group_usbfs_dev_drv_ep_management Endpoint Buffer Management Modes
********************************************************************************
* 
* The USBFS hardware block supports three endpoint buffer management modes:
* CPU (No DMA) mode (Mode 1), Manual DMA mode (Mode 2), and Automatic DMA mode (Mode 3).
* These modes are listed using enum \ref cy_en_usbfs_dev_drv_ep_management_mode_t.
* The following sub-sections provide more information about the endpoint buffer 
* management.
*
********************************************************************************
* \subsection group_usbfs_dev_drv_ep_management_buff Hardware buffers
********************************************************************************
*
* The USBFS block has a 512-byte hardware buffer that is divided between all 
* data endpoints used in the selected configuration. How the hardware buffer 
* is divided between endpoints depends on the selected endpoint buffer management
* modes:
*  
* * \ref group_usbfs_dev_drv_ep_management_mode1 and \ref  group_usbfs_dev_drv_ep_management_mode2
*   Each data endpoint consumes space (number of bytes) in the hardware buffer 
*   that is equal to the endpoint maximum packet size defined in the endpoint 
*   descriptor. The total space consumed by all endpoints is restricted
*   by the size of hardware buffer (512 bytes). When an endpoint appears in the 
*   different alternate settings and has a different maximum packet size, the greatest 
*   value is selected to the allocate space of the endpoint in the 
*   hardware buffer. This is to ensure correct USB Device operation when interface 
*   alternate settings are changed. Note that endpoint can consume extra byte in 
*   the hardware buffer when 16-bit access is used (See \ref 
*   group_usbfs_dev_drv_ep_management_buf_access for more information).
*
* * \ref group_usbfs_dev_drv_ep_management_mode3
*   Each data endpoint consumes 32 bytes in the hardware buffer (if all eight 
*   endpoints are used, the consumed buffer space is 32 * 8 = 256 byte). 
*   This buffer is called "dedicated endpoint buffer". It acts as an endpoint 
*   FIFO. The remaining space (256 bytes, if all eight endpoints are 
*   used) in the hardware buffer is used by any endpoint that currently 
*   communicates. This part of the buffer is called "common area". This hardware 
*   buffer configuration gives a sufficient dedicated buffer size for each used 
*   endpoint and common area for operation. The total space consumed by all 
*   endpoints is not restricted by the size of the hardware buffer.
*
* To access the hardware buffer, the endpoint data register is read or written by 
* CPU or DMA. On each read or write, buffer pointers are updated to access
* a next data element.
*
********************************************************************************
* \subsection group_usbfs_dev_drv_ep_management_buf_access Hardware Buffer Access
********************************************************************************
*
* The USBFS block provides two sets of data registers: 8-bit and 16-bit. Either
* the 8-bit endpoint data register or the 16-bit endpoint data register can 
* be used to read/write to the endpoint buffer. The buffer access is controlled 
* by the <i>epAccess</i> field of the driver configuration structure 
* \ref cy_stc_usbfs_dev_drv_config_t. 
* The endpoint hardware buffer and SRAM buffer must be allocated using the 
* rules below when the 16-bit access is used:
* * The buffer size must be even. If the endpoint maximum packet size is odd 
*   the allocated buffer size must be equal to (maximum packet size + 1).
* * The buffer must be aligned to the 2-byte boundary.
*
* The driver provides the \ref CY_USBFS_DEV_DRV_ALLOC_ENDPOINT_BUFFER macro that 
* applies the rules above to allocate the SRAM buffer for an endpoint. This macro 
* should be used by application to hide configuration differences. 
* <b>However, in this case the application must ignore extra bytes in the buffer.</b>
* Alternately, apply the rules above only for the 16-bits access type configuration.
*
* The driver firmware allocates an endpoint hardware buffer (dividing hardware buffer 
* between utilized endpoints). Therefore, for \ref group_usbfs_dev_drv_ep_management_mode1 
* and \ref group_usbfs_dev_drv_ep_management_mode2, an endpoint whose 
* maximum packet size is odd, consumes an extra byte in the hardware buffer 
* when the 16-bit access is used. This is not applicable for \ref group_usbfs_dev_drv_ep_management_mode3 
* because endpoints dedicated buffer are even and aligned.
*
* In addition, to operate in \ref group_usbfs_dev_drv_ep_management_mode3, 
* the driver needs an internal SRAM buffer for endpoints. The buffer size is a 
* sum of all endpoint buffers. When the 16-bit access is used, each endpoint buffer 
* must be allocated using the rules above. The driver configuration structure 
* \ref cy_stc_usbfs_dev_drv_config_t has <i>epBuffer and epBufferSize</i> fields 
* to pass the allocated buffer to the driver. \n
* For example: the USB Device uses three data endpoints whose max packets are
* 63 bytes, 63 bytes, and 8 bytes. The endpoints buffer for the driver must be 
* allocated as follows:
* *  8-bits: uint8_t endpointsBuffer[63 + 63 + 8];
* * 16-bits: uint8_t endpointsBuffer[(63+1) + (63+1) + 8] CY_ALLIGN(2); or 
*   CY_USBFS_DEV_DRV_ALLOC_ENDPOINT_BUFFER((63+1) + (63+1) + 8);
* 
********************************************************************************
* \subsection group_usbfs_dev_drv_ep_management_mode1 CPU mode (Mode 1)
********************************************************************************
*
* CPU handles data transfers between the user-provided SRAM endpoint-buffer 
* and the USB block hardware-buffer when \ref Cy_USBFS_Dev_Drv_ReadOutEndpoint 
* or \ref Cy_USBFS_Dev_Drv_LoadInEndpoint is called.
*
* \image html usbfs_ep_mngmnt_mode1.png
*
********************************************************************************
* \subsection group_usbfs_dev_drv_ep_management_mode2 Manual DMA mode (Mode 2)
********************************************************************************
*
* DMA handles data transfers between the user-provided SRAM endpoint 
* buffer and the USB block hardware buffer. The DMA request is issued by CPU 
* to execute a data transfer when \ref Cy_USBFS_Dev_Drv_ReadOutEndpoint or 
* \ref Cy_USBFS_Dev_Drv_LoadInEndpoint.
*
* \image html usbfs_ep_mngmnt_mode2.png
*
********************************************************************************
* \subsection group_usbfs_dev_drv_ep_management_mode3 Automatic DMA mode (Mode 3)
********************************************************************************
* 
* DMA handles data transfers between the driver SRAM endpoints buffer and 
* the USB block hardware buffer. The USB block generates DMA requests  
* automatically. When USB transfer starts, the USB block triggers DMA 
* requests to transfer data between the driver endpoint buffer and the hardware 
* buffer until transfer completion. The common area acts as a FIFO to (and keeps 
* data that does not fit into) the endpoint dedicated buffer. For IN endpoints, 
* the dedicated buffer is pre-loaded before enabling USB Host access to the endpoint. 
* This gives time for the DMA to provide remaining data before underflow 
* occurs. The USB block hardware has a feedback connection with the DMA 
* and does not issue new DMA request until it receives notification that the 
* previous DMA transfer completed. 
* When the \ref Cy_USBFS_Dev_Drv_ReadOutEndpoint or \ref Cy_USBFS_Dev_Drv_LoadInEndpoint 
* function is called, the memcpy function is used to copy data from/into the
* driver endpoints buffer to the user-provided endpoint buffer.
* The driver provides the \ref Cy_USBFS_Dev_Drv_OverwriteMemcpy function to 
* replace memcpy function by one that has been custom implemented (the DMA can be used for data copy).
* 
* \image html usbfs_ep_mngmnt_mode3.png
*
* \warning 
* When DMA data transfer is not fast enough, an overflow or underflow 
* interrupt triggers for the impacted endpoint. This must never happen 
* because this error condition indicates a system failure with no recovery. 
* To fix this, get the DMA channel assigned to this endpoint greater priority or 
* increase the clock the DMA operates at.
*
********************************************************************************
* \section group_usbfs_dev_drv_callbacks Callbacks Usage
********************************************************************************
*
* The driver provides the following callbacks that can be used by the application:
* 1. Data endpoint 1-8 completion. This callback is invoked when the USB Host 
* completed communication with the endpoint. For IN endpoints, it means that data has 
* been read by the USB Host. For OUT endpoints, it means that data has been written 
* by the USB Host. Call \ref Cy_USBFS_Dev_Drv_RegisterEndpointCallback to 
* register callback function.
* 
* 2. Start Of Frame packet received. This can be used in the application to 
* synchronize with SOF packets or for monitoring the bus activity. 
* Call \ref Cy_USBFS_Dev_Drv_RegisterSofCallback to register callback function. 
* 
* 3. LPM (Link Power Management) packet received. This must be used to implement 
* LPM power optimization. Call \ref Cy_USBFS_Dev_Drv_RegisterLpmCallback to 
* register callback function.
* 
* Also, the driver provides callbacks for a Bus Reset event and Control Endpoint 0 
* communication events (setup packet, in packet, out packet). But these 
* callbacks are used by middleware and must not be used by the application directly. 
* The middleware provides appropriate hooks for these events.
*
********************************************************************************
* \section group_usbfs_dev_drv_vbus VBUS Detection
********************************************************************************
*
* The USB specification requires that no device supplies current on VBUS at its 
* upstream facing port at any time. To meet this requirement, the device must 
* monitors for the presence or absence of VBUS and removes power from the Dp/Dm 
* pull-up resistor if VBUS is absent. The USBFS driver does not provide any 
* support of VBUS monitoring or detection. The application firmware must implement 
* the required functionality using a VDDUSB power pad or GPIO. Refer to the  
* Universal Serial Bus (USB) Device Mode section, sub-section VBUS Detection 
* in the technical reference manual (TRM).
* 
* Connect the VBUS through a resistive network when the 
* regular GPIO is used for VBUS detection to save the pin from voltage picks on VBUS, 
* or use GPIO tolerant over the voltage. An example schematic is shown below.
* 
* \image html usbfs_vbus_connect_schem.png
* 
* \note Power is removed when the USB cable is removed from the USB Host 
