ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_usbfs_dev_drv.h
* for bus-powered USB Device. Therefore, such a USB Device complies with 
* specification requirement above.
*
********************************************************************************
* \section group_usbfs_dev_drv_low_power Low Power Support
********************************************************************************
*
* The USBFS driver supports the USB Suspend, Resume, and Remote Wakeup functionality. 
* This functionality is tightly related with the user application. The USBFS 
* driver provides only the API interface which helps the user achieve the desired 
* low-power behavior. The additional processing is required from the user application. 
* The description of application processing is provided below.
*
* Normally, the USB Host sends an SOF packet every 1 ms (at full speed), and this
* keeps the USB Device awake. The USB Host suspends the USB Device by not 
* sending anything to the USB Device for 3 ms. To recognize this condition, the bus 
* activity must be checked. This can be done using the \ref Cy_USBFS_Dev_Drv_CheckActivity 
* function or by monitoring the SOF interrupt. A suspended device may draw no 
* more than 0.5 mA from VBUS. Therefore, put the device into low-power
* mode to consume less current. 
* The \ref Cy_USBFS_Dev_Drv_Suspend function must be called before entering 
* low-power mode. When the USB Host wants to wake the device after a suspend, 
* it does so by reversing the polarity of the signal on the data lines for at 
* least 20 ms. The resume signaling is completed with a low-speed end-of-packet 
* signal. The USB block is disabled during Deep Sleep or Hibernate low-power modes. 
* To exit a low-power mode when USB Host drives resume, a falling edge interrupt 
* on Dp must be configured before entering these modes. The \ref Cy_USBFS_Dev_Drv_Resume 
* function must be called after exiting the low-power mode. To resume communication with 
* the USB Host, the data endpoints must be managed: the OUT endpoints must be 
* enabled and IN endpoints must be loaded with data.
* 
* \note After entering low-power mode, the data which was left in the IN or OUT 
* endpoint buffers is not restored after the device's wake-up and is lost. 
* Therefore, it must be stored in the SRAM for OUT endpoint or read by the Host for 
* the IN endpoint before entering Low-power mode.
*
* If the USB Device supports remote wakeup functionality, the application has 
* to use middleware function Cy_USB_Dev_IsRemoteWakeupEnabled to determine whether 
* remote wakeup was enabled by the USB Host. When the device is suspended and 
* it determines the conditions to initiate a remote wakeup are met, 
* the application must call the \ref Cy_USBFS_Dev_Drv_Force
* function to force the appropriate J and K states onto the USB bus, signaling a 
* remote wakeup condition. Note that \ref Cy_USBFS_Dev_Drv_Resume must be called 
* first to restore the condition.
* 
********************************************************************************
* \section group_usbfs_dev_drv_lpm Link Power Management (LPM)
********************************************************************************
*
* Link Power Management is a USB low-power mode feature that provides more 
* flexibility in terms of features than the existing resume mode. This feature 
* is similar to the existing Suspend/Resume, but has transitional latencies of 
* tens of microseconds between power states (instead of 3 to greater than 20 
* millisecond latencies of the USB 2.0 Suspend/Resume).
* 
* USB2.0 Power states are re-arranged as below with the introduction of LPM. 
* The existing power states are re-named with LPM:
* * L0 (On) 
* * L1 (Sleep) -- Newly Introduced State in LPM 
* * L2 (Suspend) 
* * L3 (Powered-Off)
* 
* LPM state transitions between is shown below:
*
* \image html usbfs_lpm_state_transition.png
* 
* For example, a USB Host must transition a link from L1 (Sleep) to L0 before 
* transitioning it to L2 (Suspend), and similarly when transitioning from L2 to L1.
* 
* When a USB Host is ready to transition a USB Device from L0 to a deeper power 
* savings state, it issues an LPM transaction to the USB Device. The USB Device 
* function responds with an ACK if it is ready to make the transition or a NYET 
* (Not Yet) if it is not ready (usually because it is has data pending for the 
* USB Host). A USB Device will transmit a STALL handshake if it does not support 
* the requested link state. If the USB Device detects errors in either of the 
* token packets or does not understand the protocol extension transaction, 
* no handshake is returned.
*
* \image html usbfs_lpm_responses.png
* 
* After USB Device is initialized, the LPM transaction is to be acknowledged (ACKed) 
* meaning that the device is ready to enter the requested low-power mode. To override this 
* behavior, use \ref Cy_USBFS_Dev_Drv_Lpm_SetResponse. \n
* 
* The USB block provides an interrupt source to define that an LPM transaction was 
* received and acknowledged (ACKed). Use the \ref Cy_USBFS_Dev_Drv_RegisterLpmCallback 
* function to register the application level callback function to serve the LPM 
* transaction. The callback function can notify the application about an LPM transaction
* and can use \ref Cy_USBFS_Dev_Drv_Lpm_GetBeslValue read to read Best Effort Service 
* Latency (BESL) values provided as part of an LPM transaction. The BESL value 
* indicates the  amount of time from the start of a resume to when the USB Host 
* attempts to begin issuing transactions to the USB Device. The 
* application must use the value BESL to decide which low-power mode is entered
* to meet wakeup timing. The LPM transaction also contains the field that allows a
* remote to wake up. Use \ref Cy_USBFS_Dev_Drv_Lpm_RemoteWakeUpAllowed to get its 
* value.
* 
* LPM related USB 2.0 Extension Descriptor provides attributes fields named 
* baseline BESL and deep BESL to provide a range of values for different low-power
* optimization. The recommended use of these fields is that the 
* baseline BESL field will have a value less than the deep BESL field. The 
* expected use is the baseline BESL value communicates a nominal power savings 
* design point and the deep BESL value communicates a significant power saving 
* design point.
* For example, when the received BESL is less than baseline BESL, leave the device in  
* Active mode. When it is between baseline BESL and deep BESL, put the device into 
* Deep Sleep mode. When it is greater than deep BESL, put the device into 
* Hibernate mode.
* 
* \note 
* The driver implements the USB Full-Speed device which does not support the LPM 
* NYET response.
*
* \note 
* The device will restart after Hibernate mode and the USB Device must 
* be initialized at the application level. Call the initialization functions 
* instead of \ref Cy_USBFS_Dev_Drv_Resume. The application must ensure that 
* the device will resume within the time defined in the BESL value of LPM request.  
*
********************************************************************************
* \section group_usbfs_drv_more_information More Information
********************************************************************************
* 
* For more detail on the USB Full-Speed Device peripheral, refer to the 
* section Universal Serial Bus (USB) Device Mode in the technical reference 
* manual (TRM).
*
********************************************************************************
* \section group_usbfs_drv_MISRA MISRA-C Compliance
********************************************************************************
*
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>11.4</td>
*     <td>A</td>
*     <td>A cast should not be performed between a pointer to object type and
*         a different pointer to object type.</td>
*     <td>The function \ref Cy_USBFS_Dev_Drv_LoadInEndpoint and 
*         \ref Cy_USBFS_Dev_Drv_ReadOutEndpoint cast buffer parameters from 
*         (uint8_t *) to (uint16_t *) when 16-bit access is enabled. 
*         To handle alignment issues the macro  
*         \ref CY_USBFS_DEV_DRV_ALLOC_ENDPOINT_BUFFER must be used to 
*        allocate the buffer for the endpoint.</td>
*   </tr>
*   <tr>
*     <td>11.5</td>
*     <td>R</td>
*     <td>A cast shall not be performed that removes any const or volatile
*         qualification from the type addressed by a pointer.</td>
*     <td>
*      1. The register access-macros cast base-pointers to the USBFS peripheral 
*         registers lose the const qualification. Despite the qualification being 
*         lost, the driver ensures the proper registers access.
*      2. The volatile qualification is lost when a register address is passed 
*         as a source or destination to the DMA channel. This does not cause any 
*         negative impact because the DMA does not optimize any memory access.
*     </td>
*   </tr>
*   <tr>
*     <td>14.7</td>
*     <td>R</td>
*     <td>A function shall have a single point of exit at the end of the
*         function.</td>
*     <td>The functions can return from several points. This is typically 
*         done to improve code clarity when returning error status code if 
*         input parameters validation fail.</td>
*   </tr>
*   <tr>
*     <td>16.7</td>
*     <td>A</td>
*     <td>A pointer parameter in a function prototype should be declared as
*         pointer to const if the pointer is not used to modify the addressed
*         object.</td>
*     <td>The middleware and USBFS driver define the general function 
*         prototypes and pointers to the function types but the function's 
*         implementation depends on the configuration. Therefore, 
*         some functions' implementations require parameters to be a pointer to 
*         const but this is not met because of the generalized implementation 
*         approach.</td>
*   </tr>
* </table>
*
********************************************************************************
* \section group_usbfs_drv_changelog Changelog
********************************************************************************
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>2.0</td>
*     <td>The list of changes to support the MBED-OS USB Device stack is provided below:
*         - Changed the processing of the control transfers.
*         - Updated the endpoint 0 service functions to update the endpoint 0 registers
*           before the function returns. 
*         - Moved the set-device-address processing into the driver from the middleware.
*         - Changed the flow to configure endpoints after configuration change:  
*           unconfigure the device or remove all endpoints, add endpoints, configure 
*           the device. Updated the functions:
*           \ref Cy_USBFS_Dev_Drv_UnConfigureDevice, \ref Cy_USBFS_Dev_Drv_AddEndpoint 
*           and \ref Cy_USBFS_Dev_Drv_ConfigDevice. 
*           Removed the Cy_USBFS_Dev_Drv_ConfigDeviceComplete function because it is no needed anymore.
*         - Added the functions: \ref Cy_USBFS_Dev_Drv_Ep0ReadResult(), \ref Cy_USBFS_Dev_Drv_SetAddress()
*           and \ref Cy_USBFS_Dev_Drv_GetEp0MaxPacket(). 
*         - Changed the function signature \ref Cy_USBFS_Dev_Drv_Ep0Stall().
*         - Obsolete function Cy_USBFS_Dev_Drv_GetEndpointStallState; the \ref 
*           Cy_USBFS_Dev_Drv_GetEndpointState() updated to be used instead of the obsolete function.
*         - Reduced the time required to complete abort operation in function \ref Cy_USBFS_Dev_Drv_Abort.
*           Obsolete function Cy_USBFS_Dev_Drv_AbortComplete because entire abort operation is handled by
*           \ref Cy_USBFS_Dev_Drv_Abort.
*         - Added the endpoint address argument to the \ref cy_cb_usbfs_dev_drv_ep_callback_t to simplify
*           endpoint transfer complete event processing for the MBED-OS USB Device stack.
*     </td>
*     <td>Updated the driver to support the MBED-OS USB Device stack and Cypress 
*         USB Device middleware.</td>
*   </tr>
*   <tr>
*     <td rowspan="2">1.10</td>
*     <td>Fixed the \ref Cy_USBFS_Dev_Drv_Disable function to not disable DMA
*         in CPU mode.</td>
*     <td>Calling this function triggers assert because DMA for endpoints is not 
*         initialized/used in the CPU mode.</td>
*   </tr>
*   <tr>
*     <td>Updated the condition statement in the \ref CY_USBFS_DEV_DRV_ALLOC_ENDPOINT_BUFFER
*         macro to explicitly check against non-zero.</td>
*     <td>Fixed MISRA 13.2 violation in the macro.</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>The initial version.</td>
*     <td></td>
*   </tr>
* </table>
*
********************************************************************************
*
* \defgroup group_usbfs_dev_drv_macros Macros
* \{
      \defgroup group_usbfs_dev_drv_macros_intr_level Interrupt Level
*     \defgroup group_usbfs_dev_drv_macros_intr_cause Interrupt Cause
*     \defgroup group_usbfs_dev_drv_macros_ep_xfer_err Transfer Errors
* \}
* \defgroup group_usbfs_dev_drv_functions Functions
* \{
*     \defgroup group_usbfs_dev_hal_functions_common          Initialization Functions
*     \defgroup group_usbfs_dev_drv_functions_interrupts      Interrupt Functions
*     \defgroup group_usbfs_dev_hal_functions_ep0_service     Endpoint 0 Service Functions
*     \defgroup group_usbfs_dev_hal_functions_endpoint_config Data Endpoint Configuration Functions
*     \defgroup group_usbfs_dev_hal_functions_data_xfer       Data Endpoint Transfer Functions
*     \defgroup group_usbfs_dev_drv_functions_low_power       Low Power Functions
*     \defgroup group_usbfs_dev_drv_functions_lpm             LPM (Link Power Management) Functions
* \} 
* \defgroup group_usbfs_dev_drv_data_structures Data Structures
* \defgroup group_usbfs_dev_drv_enums           Enumerated Types
* \} 
*/


#if !defined(CY_USBFS_DEV_DRV_H)
#define CY_USBFS_DEV_DRV_H

