ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_usbfs_dev_drv.h
/*******************************************************************************
*                                  Type Definitions
*******************************************************************************/

/**
* \addtogroup group_usbfs_dev_drv_data_structures
* \{
*/

/** Data Endpoint Configuration Structure */
typedef struct
{
    bool     enableEndpoint;    /**< Defines if the endpoint becomes active after configuration */
    bool     allocBuffer;       /**< Defines if the endpoint needs buffer allocation */
    uint16_t maxPacketSize;     /**< The endpoint max packet size */
    uint16_t bufferSize;        /**< The endpoint buffer size (the biggest max packet size
                                     across all alternate for this endpoint) */
    uint8_t  endpointAddr;      /**< The endpoint address (number plus direction bit) */
    uint8_t  attributes;        /**< The endpoint attributes */ 
} cy_stc_usb_dev_ep_config_t;

/**
* Driver context structure prototype.
* The driver define this structure type \ref cy_stc_usbfs_dev_drv_context_t.
*/
struct cy_stc_usbfs_dev_drv_context;

/**
* Provides the typedef for the callback function called in the
* \ref Cy_USBFS_Dev_Drv_Interrupt to notify the user interrupt events.
*/
typedef void (* cy_cb_usbfs_dev_drv_callback_t)(USBFS_Type *base, 
                                                struct cy_stc_usbfs_dev_drv_context *context);

/**
* Provides the typedef for the callback function called in the
* \ref Cy_USBFS_Dev_Drv_Interrupt to notify the user about endpoint transfer 
* completion event.
*/
typedef void (* cy_cb_usbfs_dev_drv_ep_callback_t)(USBFS_Type *base, 
                                                   uint32_t endpointAddr,
                                                   uint32_t errorType, 
                                                   struct cy_stc_usbfs_dev_drv_context *context);

/**
* Provides the typedef for the user defined function to replace library provided 
* memcpy function to copy data from endpoint buffer to the user buffer.
*/
typedef uint8_t * (* cy_fn_usbfs_dev_drv_memcpy_ptr_t)(uint8_t *dest, 
                                                       const uint8_t *src, 
                                                       uint32_t size);

/** \cond INTERNAL*/

/**
* Specifies the typedef for the pointer to the function that adds a data endpoint
*/
typedef cy_en_usbfs_dev_drv_status_t (* cy_fn_usbfs_dev_drv_add_ep_ptr_t)
                                        (USBFS_Type *base,
                                         cy_stc_usb_dev_ep_config_t const *config,
                                         struct cy_stc_usbfs_dev_drv_context     *context);

/**
* Specifies the typedef for the pointer to the function that loads data into
* the data endpoint.
*/
typedef cy_en_usbfs_dev_drv_status_t (* cy_fn_usbfs_dev_drv_load_ep_ptr_t)
                                        (USBFS_Type    *base,
                                         uint32_t       endpoint,
                                         const uint8_t *buffer,
                                         uint32_t       size,
                                         struct cy_stc_usbfs_dev_drv_context *context);

/**
* Specifies the typedef for the pointer to the function that reads data from
* the data endpoint.
*/
typedef cy_en_usbfs_dev_drv_status_t (* cy_fn_usbfs_dev_drv_read_ep_ptr_t)
                                        (USBFS_Type *base,
                                         uint32_t    endpoint,
                                         uint8_t    *buffer,
                                         uint32_t    size,
                                         uint32_t   *actSize,
                                         struct cy_stc_usbfs_dev_drv_context *context);
/** \endcond */

/** DMA Channel Configuration Structure */
typedef struct
{
    DW_Type *base;          /**< Pointer to the DMA base */
    uint32_t chNum;         /**< Channel number */
    uint32_t priority;      /**< Channel's priority */
    bool     preemptable;   /**< Specifies whether the channel is preempt-able by another higher-priority channel */

    /** DMA out trigger mux (applicable only when mode is 
    * \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO)
    */
    uint32_t outTrigMux;

    /** The pointer to the 1st allocated DMA descriptor (required for DMA operation) */
    cy_stc_dma_descriptor_t *descr0;

    /** The pointer to the 2nd allocated DMA descriptor (required when mode is 
    * \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO) 
    */
    cy_stc_dma_descriptor_t *descr1;

} cy_stc_usbfs_dev_drv_dma_config_t;

/** Driver Configuration Structure */
typedef struct cy_stc_usbfs_dev_drv_config
{
    /** Endpoints management mode */
    cy_en_usbfs_dev_drv_ep_management_mode_t mode;

    /** DMA channels configuration for the endpoints.
    * Only DMChannels for active endpoints must be configured. Provide NULL 
    * pointer if endpoint is not used. Applicable when \ref mode is 
    * \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA or \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO.
    */
    const cy_stc_usbfs_dev_drv_dma_config_t *dmaConfig[CY_USBFS_DEV_DRV_NUM_EPS_MAX];

    /** 
    * The pointer to the buffer allocated for the OUT endpoints (applicable only when \ref mode 
    * is \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO)
    */
    uint8_t  *epBuffer;
    
    /** 
    * The size of the buffer for the OUT endpoints (applicable only when \ref mode 
    * is \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO)
    */
    uint16_t  epBufferSize;

    /** The mask that assigns interrupt sources to trigger: Low, Medium, or High interrupt.
    * Use the macros provided in group_usbfs_dev_drv_macros_intr_level to initialize the 
    * intrLevelSel mask.
    */
    uint32_t intrLevelSel;

    /** Enables LPM (Link Power Management) response */
    bool enableLpm;

    /** Data endpoints access type */
    cy_en_usbfs_dev_ep_access_t epAccess;

} cy_stc_usbfs_dev_drv_config_t;

