ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_usbfs_dev_drv.h
/** \cond INTERNAL: Endpoint Structure */
typedef struct
{
    volatile uint8_t address; /**< Endpoint address (include direction bit) */
    volatile uint8_t toggle;  /**< Toggle bit in SIE_EP_CNT1 register */
    volatile uint8_t sieMode; /**< SIE mode to arm endpoint on the bus */

    uint8_t  *buffer;              /**< The pointer to the buffer */
    volatile uint16_t bufferSize;  /**< Endpoint buffer size */
    volatile uint16_t startBuf;    /**< Start of the buffer */

    volatile bool isPending;   /**< Save the pending state before stall endpoint */
    volatile cy_en_usb_dev_ep_state_t state; /**< Endpoint state */

    /** Completes an event notification callback */
    cy_cb_usbfs_dev_drv_ep_callback_t epComplete;

    DW_Type *base;          /**< The pointer to the DMA base */
    uint32_t chNum;         /**< DMA Channel number */
    uint32_t outTrigMux;    /**< Out trigger mux for DMA channel number */

    cy_stc_dma_descriptor_t* descr0;    /**< The pointer to the descriptor 0 */
    cy_stc_dma_descriptor_t* descr1;    /**< The pointer to the descriptor 1 */
    
    cy_fn_usbfs_dev_drv_memcpy_ptr_t copyData;  /**< The pointer to the user memcpy function */

} cy_stc_usbfs_dev_drv_endpoint_data_t;
/** \endcond */

/** USBFS Device context structure.
* All fields for the context structure are internal. The firmware never reads or
* writes these values. The firmware allocates a structure and provides the
* address of the structure to the middleware in HID function calls. The firmware 
* must ensure that the defined instance of this structure remains in scope while
* the middleware is in use.
*/
typedef struct cy_stc_usbfs_dev_drv_context
{
    /** \cond INTERNAL */
    /** Stores the Endpoint 0 buffer to put the read operation results */
    uint8_t *ep0Buffer;

    /** Stores the Endpoint 0 buffer size */
    uint8_t ep0BufferSize;

    /** Endpoint 0 data toggle bit: 0 or USBFS_USBDEV_EP0_CNT_DATA_TOGGLE_Msk */
    uint8_t  ep0DataToggle;

    /** Active endpoint mask */
    uint8_t activeEpMask;

    /** The device address to set */
    uint8_t address;

    /** Defines the list of endpoints that waits for abort completion */
    volatile uint8_t epAbortMask;

    /** Endpoints management mode */
    cy_en_usbfs_dev_drv_ep_management_mode_t mode;

    /** Stores the control transfer state */
    cy_en_usbfs_dev_drv_ep0_ctrl_state_t ep0CtrlState;

    /* Status to set or not the device address after the status state of the control transfer */
    bool    setAddress;

    /** Defines which endpoint registers to use: 8-bits or 16-bits */
    bool useReg16;

    /** Bus reset callback notification */
    cy_cb_usbfs_dev_drv_callback_t busReset;

    /** Endpoint 0: Setup packet has received callback notification */
    cy_cb_usbfs_dev_drv_callback_t ep0Setup;

    /** Endpoint 0: IN data packet has received callback notification */
    cy_cb_usbfs_dev_drv_callback_t ep0In;

    /** Endpoint 0: OUT data packet has received callback notification */
    cy_cb_usbfs_dev_drv_callback_t ep0Out;

    /** SOF frame has received callback notification */
    cy_cb_usbfs_dev_drv_callback_t cbSof;

    /** LPM request has received callback notification */
    cy_cb_usbfs_dev_drv_callback_t cbLpm;

    /** Pointer to addEndpoint function: depends on operation mode */
    cy_fn_usbfs_dev_drv_add_ep_ptr_t addEndpoint;

    /** Pointer to loadInEndpoint function: depends on operation mode */
    cy_fn_usbfs_dev_drv_load_ep_ptr_t loadInEndpoint;

    /** Pointer to readOutEndpoint function: depends on operation mode */
    cy_fn_usbfs_dev_drv_read_ep_ptr_t readOutEndpoint;

    uint8_t  *epSharedBuf;     /**< Buffer for OUT endpoints */
    uint16_t  epSharedBufSize; /**< Buffer size */

    uint16_t  curBufAddr; /** Current position in endpoint buffer (HW or SRAM) */

    /** Stores endpoints information */
    cy_stc_usbfs_dev_drv_endpoint_data_t epPool[CY_USBFS_DEV_DRV_NUM_EPS_MAX];

    /** The pointer to the device context structure */
    void *devConext;
    /** \endcond */
} cy_stc_usbfs_dev_drv_context_t;
/** \} group_usbfs_dev_drv_data_structures */


/*******************************************************************************
*                              Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_usbfs_dev_hal_functions_common
* \{
* The Initialization functions provide an API to begin the USBFS driver operation 
* (configure and enable) and to stop operation (disable and de-initialize).
*/
cy_en_usbfs_dev_drv_status_t Cy_USBFS_Dev_Drv_Init(USBFS_Type *base,
                                                   cy_stc_usbfs_dev_drv_config_t const *config,
                                                   cy_stc_usbfs_dev_drv_context_t      *context);

void Cy_USBFS_Dev_Drv_DeInit(USBFS_Type *base, 
                             cy_stc_usbfs_dev_drv_context_t *context);

void Cy_USBFS_Dev_Drv_Enable(USBFS_Type *base, 
                             cy_stc_usbfs_dev_drv_context_t const *context);

void Cy_USBFS_Dev_Drv_Disable(USBFS_Type *base, 
                              cy_stc_usbfs_dev_drv_context_t *context);

__STATIC_INLINE void Cy_USBFS_Dev_Drv_SetAddress(USBFS_Type *base, uint8_t address, 
                                                 cy_stc_usbfs_dev_drv_context_t *context);
__STATIC_INLINE void     Cy_USBFS_Dev_Drv_SetDeviceAddress(USBFS_Type *base, uint8_t address);
__STATIC_INLINE uint32_t Cy_USBFS_Dev_Drv_GetDeviceAddress(USBFS_Type const *base);

__STATIC_INLINE void  Cy_USBFS_Dev_Drv_SetDevContext(USBFS_Type const *base,
                                                     void *devContext, 
                                                     cy_stc_usbfs_dev_drv_context_t *context);

__STATIC_INLINE void* Cy_USBFS_Dev_Drv_GetDevContext(USBFS_Type const *base,
                                                     cy_stc_usbfs_dev_drv_context_t *context);

void Cy_USBFS_Dev_Drv_ConfigDevice(USBFS_Type *base, 
                                     cy_stc_usbfs_dev_drv_context_t *context);

void Cy_USBFS_Dev_Drv_UnConfigureDevice(USBFS_Type *base, 
                                        cy_stc_usbfs_dev_drv_context_t *context);
/** \} group_usbfs_dev_hal_functions_common */

/**
* \addtogroup group_usbfs_dev_hal_functions_ep0_service
* \{
* The Endpoint 0 Service functions provide an API to establish communication with 
* the USB Host using control endpoint 0.
*/
void Cy_USBFS_Dev_Drv_Ep0GetSetup(USBFS_Type const *base,
                                  uint8_t    *buffer,
                                  cy_stc_usbfs_dev_drv_context_t const *context);

